# MacroManagerIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManagerIterator Class
Members See Also
---
An iterator to a MacroManager.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MacroManagerIterator : IEnumerator<MacroModule>
```

Visual Basic
---
```text
Public Class MacroManagerIterator _
	Implements IEnumerator(Of MacroModule)
```

Visual C++
---
```text
public ref class MacroManagerIterator : IEnumerator<MacroModule^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Macros..::..MacroManagerIterator
# See Also
MacroManagerIterator Members
Autodesk.Revit.DB.Macros Namespace